app/views/admins/show.html.erb

SELECT "schools".* FROM "schools" WHERE "schools"."admin_id" = ?  [["admin_id", 1]]
---
<ul class="schools">
  <% School.where(admin_id: @admin.id).each do |school| %>