app/views/students/show.html.erb

SELECT "donations".* FROM "donations" WHERE "donations"."student_id" = ?  [["student_id", 1]]
---
            <span><span class="student-stats"><%= @student.mins_read %></span> minutes read</span>
            <span class="my-8"><span class="student-stats"><%= @student.donations.count %></span> sponsors</span>