app/views/teachers/show.html.erb

<ul class="students">
  <% Student.where(teacher_id: @teacher.id).each do |student| %>
---
SELECT "students".* FROM "students" WHERE "students"."teacher_id" = ?  [["teacher_id", 1]]