app/views/schools/show.html.erb

<ul class="teachers">
  <% Teacher.where(school_id: @school.id).each do |teacher| %>
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."school_id" = ?  [["school_id", 1]]