app/controllers/admins_controller.rb

  def create
    Admin.create(admin_params)
---
INSERT INTO "admins" ("name", "email", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Tanner Wernecke"], ["email", "t@gmail.com"], ["phone", "5405322160"], ["created_at", "2019-11-15 19:24:36.785192"], ["updated_at", "2019-11-15 19:24:36.785192"]]