app/controllers/donations_controller.rb

INSERT INTO "donations" ("created_at", "updated_at", "amount", "donor", "student_id", "message") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2019-11-14 18:47:58.826651"], ["updated_at", "2019-11-14 18:47:58.826651"], ["amount", 50.0], ["donor", "Mom"], ["student_id", 1], ["message", "Yay!"]]
---
  def create
    Stripe.api_key = Rails.application.credentials[:stripe][Rails.env.to_sym][:secret_key]

    # TODO change to actual urls
    # Set success and cancel url
    success_url = params[:student_id] ? ("https://young-castle-99344.herokuapp.com/students/" + params[:student_id] + "/success")
                                      : ("https://young-castle-99344.herokuapp.com/schools/" + params[:school_id] + "/success")
    cancel_url = params[:student_id] ? ("https://young-castle-99344.herokuapp.com/students/" + params[:student_id])
                                     : ("https://young-castle-99344.herokuapp.com/schools/" + params[:school_id])

    @session = Stripe::Checkout::Session.create(
      payment_method_types: ["card"],
      line_items: [{
        name: "Donation",
        description: "One time donation to Bookworm.",
        amount: params[:amount].to_i * 100,
        currency: "usd",
        quantity: 1
      }],
      success_url: success_url,
      cancel_url: cancel_url
    )