app/controllers/schools_controller.rb

INSERT INTO "schools" ("name", "email", "phone", "address", "about", "goal", "created_at", "updated_at", "admin_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    School.create(school_params.merge(admin: current_user))

SELECT "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_school
    @school = School.find(params[:id])