app/controllers/students_controller.rb

INSERT INTO "students" ("id", "name", "goal", "created_at", "updated_at", "teacher_id") VALUES (?, ?, ?, ?, ?, ?)  [["id", 1], ["name", "Bill"], ["goal", 100.0], ["created_at", "2019-11-14 18:47:15.948852"], ["updated_at", "2019-11-14 18:47:15.948852"], ["teacher_id", 1]]
---
  def create
    Student.create(student_params) #.merge(school: current_user.school)