app/controllers/teachers_controller.rb

  def create
    Teacher.create(teacher_params)
---
INSERT INTO "teachers" ("name", "email", "phone", "goal", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Sam"], ["email", "sam@example.com"], ["phone", "5405334120"], ["goal", 500.0], ["created_at", "2019-11-14 18:46:14.060061"], ["updated_at", "2019-11-14 18:46:14.060061"]]

  def set_teacher
    @teacher = Teacher.find(params[:id])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_students
    @students = Student.where(teacher_id: @teacher.id)
---
SELECT "students".* FROM "students" WHERE "students"."teacher_id" = ?  [["teacher_id", 1]]