app/controllers/teachers_controller.rb

INSERT INTO "users" ("type", "first_name", "last_name", "email", "phone", "goal", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    password = SecureRandom.hex(8)
    Teacher.create(teacher_params.merge(school: current_user.school, password: password, code: password))