app/models/school.rb

SELECT "teachers".* FROM "teachers" WHERE "teachers"."school_id" = ?  [["school_id", 1]]
---
  def sum
    sum = 0.0
    Teacher.where(school_id: id).each do |teacher|