app/models/student.rb

  def sum
    sum = 0.0
    Donation.where(student_id: id).each do |donation|
---
SELECT "donations".* FROM "donations" WHERE "donations"."student_id" = ?  [["student_id", 2]]