app/models/teacher.rb

SELECT "students".* FROM "students" WHERE "students"."teacher_id" = ?  [["teacher_id", 2]]
---
  def sum
    sum = 0.0
    Student.where(teacher_id: id).each do |student|